<policy>
    <general>
        <name>ASAP: Push %PROD_NAME%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>true</trigger_enrollment_complete>
        <trigger_login>true</trigger_login>
        <trigger_logout>true</trigger_logout>
        <trigger_network_state_changed>true</trigger_network_state_changed>
        <trigger_startup>true</trigger_startup>
        <trigger_other />
        <frequency>Once per computer</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
	<scope>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
		<!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
