<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest PulseSecure and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.ftiff.ftiff-autopkg.jss.PulseSecure</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Pulse Secure (VPN)</string>
            <key>SHORT_NAME</key>
            <string>PulseSecure</string>
            <key>PKGPATH</key>
            <string>%RECIPE_DIR%/payload/PulseSecure-5.1.5.61437.pkg</string>
            <key>VERSION</key>
            <string>5.1.5.61437</string>
            <key>CATEGORY</key>
            <string>Security</string>

            <!-- Policy: Other Trigger -->
            <key>POLICY_TEMPLATE</key>
            <string>P-AutoPkg.xml</string>
            <key>TRIGGER_OTHER</key>
            <string>pulsesecureapp</string>
            <key>FREQUENCY</key>
            <string>ongoing</string>
            <key>POLICY_CATEGORY</key>
            <string>_AutoPkg</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>Process</key>
        <array>
            <!-- Policy: Other Trigger -->
            <dict>
                <key>Arguments</key>
                <dict>
                   <key>pkg_path</key>
                   <string>%PKGPATH%</string>
                   <key>version</key>
                   <string>%VERSION%</string>
                   <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
